[
  {
    "id": 1,
    "date": "22/08/2016",
    "category": "Personal",
    "imgUrl": "assets/images/blog/01.png",
    "title": "New Metallica!!!",
    "excerpt":"So Metallica just announced the release date for their next studio album as well as dropped the first single. The album's called Hardwired... to Self-Destruct and is dropping on the 18th of November.",
    "firstpara":"So Metallica just dropped the release date for their next album Hardwired... to Self Destruct as well as released the self-titled first single. Considering that Metallica is my favorite band ever November cannot come fast enough.",
    "secondpara":"The single 'Hardwired' isn't really doing anything for me and sounds like some generic thrash to please the more hardcore fans, sort of like 'My Apocalypse' off Death Magnetic. The other song snippets sound amazing though. Bluesy Load style solos and a Black album styled melodic chorus. It's good to see that the production is pretty good this time around compared to the train-wreck that was Death Magnetic whch was such a shame as it was a really good album musically.\n\nI have really fond memories of the leadup to Death Magnetic in 2008 participating in online forums regarding possible track sequences, song styles etc. Time to dust off my old Metallicabb account and dive in again, I guess. The album cover sucks though.",
    "quote":"Hardwired... to Self-Destruct, the 9th Metallica studio album releases November 18th",
    "tags":["Personal","Music","Metallica"]
  },
  {
    "id": 2,
    "date": "20/08/2016",
    "category": "Technical",
    "imgUrl": "assets/images/blog/03.png",
    "title":"Building a portfolio site with React",
    "excerpt":"I built my portfolio site in React and it involves all of the react staples (routing using React Router, states using Redux, AJAX requests using JQuery etc). This is hosted on my github so anyone who is interested can fork from there.",
    "firstpara":"I was in need of a portfolio site which I built in React as I also wanted to test out my React concepts like routing, http requests, states etc. I already had experience with Angular 1.5 and 2 so I knew basic MVC concepts and the learning curve was pretty smooth. It's hosted on my github so anyone in need of a new portfolio site can fork it from there.",
    "secondpara":"I'll just give a rundown of the various functionalities I implemented in brief.\n\nRouting - I used the react-router library to handle loading the various components with changes of route. I also handled sub-routes for the blog and works section with parameters being pulled from the route itself which was used to get data from a backend and populate the page. The sliding animations were done using simple CSS classes.\n\nRedux - I had implemented pagination for the works and blog section but it would revert to the first page if you would navigate elsewhere. To maintain the last viewed page I used Redux to maintain the states. Later on when the number of projects and blogs become too much I'll probably convert the pagination to route based with individual 'pages' being called from the server.\n\n Loading - I implemented the loading screens using image events. Images emit events upon fully loading so I wrapped up all the images on the site in a custom component. A function would lsiten to these image events and would fade out the loading overlay when all the images nested within a DOM element were fully loaded.",
    "quote":"My portfolio site implements all the React staples including http requests, Redux and React-Router",
    "tags":["Technical"]
  },
  {
    "id": 3,
    "date": "13/07/2016",
    "category": "Personal",
    "imgUrl": "assets/images/blog/04.png",
    "title":"Overwatch",
    "excerpt":"I just got on the Overwatch bandwagon and it's really really good. I feel like a kid in the late 90s playing around with Quake and Unreal Tournament.",
    "firstpara":"So I just got on the Overwatch bandwagon and it's really really good. It's a Blizzard game so an exceptional level of polish is expected but that doesn't make it any less satisfying. The fast gameplay in a way reminds me of my childhood playing Quake 3 and Unreal Tournament. ",
    "secondpara":"The fact that it is assymetric and has a vast variety of characters ensure that you never get bored despit the limited number of maps for now. Also the Pixar-esque visual aesthetic is really appealing and makes it stand out from the hordes of dreary cover based shooters available in today's market.\n\nI am currently really enjoying playing Junkrat, a defensive hero whose main strategy is to spam areas with grenades. Also my aiming has reduced to tosh due to years of playing only strategy and role playing games so Junkrat is a nice foil to my limited skillset. Looking forward to improving my skills in the coming days and switch to one of the more sexier heroes - maybe a ninja.",
    "quote":"Overwatch is really really fun and a breath of fresh air in today's environment of grim military shooters",
    "tags":["Personal","Video Games","Overwatch"]
  }
]
